# Working with Text Data

In [46]:
import pandas as pd

## This Module's Dataset
- This module's dataset (`chicago.csv`) is a collection of public sector employees in the city of Chicago.
- Each row inclues the employee's name, position, department, and salary.

In [47]:
chicago = pd.read_csv("chicago.csv").dropna(how="all")
chicago.head()

                  Name            Position Title        Department Employee Annual Salary
0      AARON,  ELVIA J          WATER RATE TAKER       WATER MGMNT              $90744.00
1    AARON,  JEFFERY M            POLICE OFFICER            POLICE              $84450.00
2       AARON,  KARINA            POLICE OFFICER            POLICE              $84450.00
3  AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  GENERAL SERVICES              $89880.00
4  ABAD JR,  VICENTE M         CIVIL ENGINEER IV       WATER MGMNT             $106836.00

In [ ]:
chicago.info()

In [ ]:
chicago.nunique()

In [ ]:
chicago["Department"]= chicago["Department"].astype("category")

In [ ]:
chicago.info()

## Common String Methods
- A **Series** has a special `str` attribute that exposes an object with string methods.
- Access the `str` attribute, then invoke the string method on the nested object.
- Most method names will match their Python method equivalents (`upper`, `lower`, `title`, etc).

In [ ]:
water_workers = chicago["Position Title"].str.lower().str.contains("water")
chicago[water_workers]

In [ ]:
start_with = chicago['Position Title'].str.lower().str.startswith("civil")
start_with

In [ ]:
chicago[start_with]

## Filtering with String Methods
- The `str.contains` method checks whether a substring exists anywhere in the string.
- The `str.startswith` method checks whether a substring exists at the start of the string.
- The `str.endswith` method checks whether a substring exists at the end of the string.

## String Methods on Index and Columns
- Use the `index` and `columns` attributes to access the **DataFrame** index/column labels.
- These objects support string methods via their own `str` attribute.

## The split Method
- The `str.split` method splits a string by the occurrence of a delimiter. Pandas returns a **Series** of lists.
- Use the `str.get` method to access a nested list element by its index position.

In [ ]:
chicago = pd.read_csv("chicago.csv").dropna(how="all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.head()

In [ ]:
a = chicago["Position Title"].str.split(" ")

In [ ]:
a.str.get(1)

## More Practice with Splits

## The expand and n Parameters of the split Method
- The `expand` parameter returns a **DataFrame** instead of a **Series** of lists.
- The `n` parameter limits the number of splits.

In [48]:
chicago

                      Name                  Position Title        Department Employee Annual Salary
0          AARON,  ELVIA J                WATER RATE TAKER       WATER MGMNT              $90744.00
1        AARON,  JEFFERY M                  POLICE OFFICER            POLICE              $84450.00
2           AARON,  KARINA                  POLICE OFFICER            POLICE              $84450.00
3      AARON,  KIMBERLEI R        CHIEF CONTRACT EXPEDITER  GENERAL SERVICES              $89880.00
4      ABAD JR,  VICENTE M               CIVIL ENGINEER IV       WATER MGMNT             $106836.00
...                    ...                             ...               ...                    ...
32057  ZYGADLO,  MICHAEL J  FRM OF MACHINISTS - AUTOMOTIVE  GENERAL SERVICES              $99528.00
32058   ZYGOWICZ,  PETER J                  POLICE OFFICER            POLICE              $87384.00
32059    ZYMANTAS,  MARK E                  POLICE OFFICER            POLICE              $84450.00
32060  ZYRKOWSKI,  CARLO E                  POLICE OFFICER            POLICE              $87384.00
32061  ZYSKOWSKI,  DARIUSZ         CHIEF DATA BASE ANALYST              DoIT             $113664.00

[32062 rows x 4 columns]

In [49]:
chicago["Name"].str.split()

0             [AARON,, ELVIA, J]
1           [AARON,, JEFFERY, M]
2               [AARON,, KARINA]
3         [AARON,, KIMBERLEI, R]
4        [ABAD, JR,, VICENTE, M]
                  ...
32057     [ZYGADLO,, MICHAEL, J]
32058      [ZYGOWICZ,, PETER, J]
32059       [ZYMANTAS,, MARK, E]
32060     [ZYRKOWSKI,, CARLO, E]
32061      [ZYSKOWSKI,, DARIUSZ]
Name: Name, Length: 32062, dtype: object

In [51]:
chicago["Name"].str.split(",", expand=True)

               0              1
0          AARON        ELVIA J
1          AARON      JEFFERY M
2          AARON         KARINA
3          AARON    KIMBERLEI R
4        ABAD JR      VICENTE M
...          ...            ...
32057    ZYGADLO      MICHAEL J
32058   ZYGOWICZ        PETER J
32059   ZYMANTAS         MARK E
32060  ZYRKOWSKI        CARLO E
32061  ZYSKOWSKI        DARIUSZ

[32062 rows x 2 columns]